config.org
#+Title: Emacs Kickstarter
#+Author: MiniApollo
#+Description: A starting point for Gnu Emacs with good defaults and packages that most people may want to use.
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes
#+Startup: showeverything
#+Options: toc:2

* Table Of Contents :toc:
- [[#introduction][Introduction]]
- [[#important-to-load-first][Important to load first]]
- [[#multi-file-example][Multi File Example]]
  - [[#adding-the-lisp-directory-to-load-path][Adding the lisp directory to load-path]]
  - [[#sourcing-the-files][Sourcing the files]]
  - [[#using-the-file][Using the file]]
  - [[#auto-save-if-auto-tangle-header-is-on][Auto save if auto tangle header is on]]

* Introduction
#+begin_src emacs-lisp
  ;; Kickstart.emacs is *not* a distribution.
  ;; It's a template for your own configuration.
  ;;
  ;; Configure it from this config.org file.
  ;; Read every line, understand your configuration, and modify it as needed.
  ;;
  ;; Delete this once you're comfortable with your setup.
#+end_src

* Important to load first
;; Load Emacs‑only settings (if you separated those into emacs-settings.el)
#+begin_src emacs-lisp
    (require 'configs)
#+end_src

* Multi File Example
** Adding the lisp directory to load-path
#+begin_src emacs-lisp
  (setq user-emacs-directory "~/.config/MainEmacs/")
  (add-to-list 'load-path (expand-file-name "lisp" user-emacs-directory))
#+end_src

** Sourcing the files
#+begin_src emacs-lisp
    (require 'example)
    (require 'package_configs)  ;; Now loaded here instead of in config.org
    (require 'keymaps)
    (require 'packages)
    ;; The previous (require 'packages) has been replaced by loading package_configs.el below.
#+end_src

** Using the file
#+begin_src emacs-lisp
  ;; (start/hello)
#+end_src

** Auto save if auto tangle header is on
#+begin_src emacs-lisp
  (defun my/org-auto-tangle ()
    "Automatically tangle the org file if it contains a tangle header."
    (when (and (buffer-file-name)
               (string-suffix-p ".org" (buffer-file-name)))
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))
  
  (add-hook 'after-save-hook #'my/org-auto-tangle)
#+end_src

